.metadata/.plugins/org.eclipse.core.resources/.history/ca/40278c9bd1b8001910e7cdd0bfd9b2a5

<?xml version="1.0" encoding="UTF-8"?>
<definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsd1="http://www.opentravel.org/OTA/2003/05/beta" xmlns:tns="https://webservices.sabre.com/websvc" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" targetNamespace="https://webservices.sabre.com/websvc">
	<types>
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://www.opentravel.org/OTA/2003/05/beta" schemaLocation="PaymentRQ_v4.13.0.xsd"/>
			<xsd:import namespace="http://www.ebxml.org/namespaces/messageHeader" schemaLocation="../common/msg-header-2_0.xsd"/>
			<xsd:import namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" schemaLocation="../common/wsse.xsd"/>
		</xsd:schema>
	</types>
	<message name="PaymentServiceInput">
		<part name="header" element="eb:MessageHeader"/>
		<part name="header2" element="wsse:Security"/>
		<part name="body" element="xsd1:PaymentRQ"/>
	</message>
	<message name="PaymentServiceOutput">
		<part name="header" element="eb:MessageHeader"/>
		<part name="header2" element="wsse:Security"/>
		<part name="body" element="xsd1:PaymentRS"/>
	</message>
	<portType name="PaymentServicePortType">
		<operation name="PaymentServiceRQ">
			<input message="tns:PaymentServiceInput"/>
			<output message="tns:PaymentServiceOutput"/>
		</operation>
	</portType>
	<binding name="PaymentServiceSoapBinding" type="tns:PaymentServicePortType">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<operation name="PaymentServiceRQ">
			<soap:operation soapAction="OTA"/>
			<input>
				<soap:header message="tns:PaymentServiceInput" part="header" use="literal"/>
				<soap:header message="tns:PaymentServiceInput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</input>
			<output>
				<soap:header message="tns:PaymentServiceOutput" part="header" use="literal"/>
				<soap:header message="tns:PaymentServiceOutput" part="header2" use="literal"/>
				<soap:body parts="body" use="literal"/>
			</output>
		</operation>
	</binding>
	<service name="PaymentServiceService">
		<port name="PaymentServicePortType" binding="tns:PaymentServiceSoapBinding">
			<soap:address location="https://webservices.sabre.com"/>
		</port>
	</service>
</definitions>
