src/test/resources/UnitTestPaymentRQ.xml

<?xml version="1.0" encoding="UTF-8"?><ns1:Envelope xmlns:ns5="http://www.w3.org/1999/xlink" xmlns:ns1="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns4="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns3="http://www.w3.org/2000/09/xmldsig#"><ns1:Header><ns4:MessageHeader><ns4:CPAId>NQ2F</ns4:CPAId><ns4:ConversationId>SHS::H9480305477441::13::2025145:CONF11</ns4:ConversationId><ns4:Service>PaymentRQ</ns4:Service><ns4:Action>PaymentRQ</ns4:Action></ns4:MessageHeader><ns2:Security xmlns:ns2="http://schemas.xmlsoap.org/ws/2002/12/secext"><ns2:BinarySecurityToken>testathid</ns2:BinarySecurityToken></ns2:Security></ns1:Header><ns1:Body><ns0:PaymentRQ Version="3.0.0" xmlns:ns0="http://www.opentravel.org/OTA/2003/05/beta"><ns0:Action/><ns0:POS PseudoCityCode="NQ2F" StationNumber="NQ2F" ChannelID="CRS" LocalDateTime="2015-04-21T09:26:36.257" SourceID="Synxis"><ns0:BrowserDetail><ns0:HttpHeaders><ns0:HttpHeader Name="accept-language">en</ns0:HttpHeader><ns0:HttpHeader Name="accept-encoding">gzip, deflate, lzma, sdch</ns0:HttpHeader><ns0:HttpHeader Name="user-agent">Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/39.0.2171.95 Safari/537.36</ns0:HttpHeader><ns0:HttpHeader Name="cache-control">max-age=0</ns0:HttpHeader></ns0:HttpHeaders></ns0:BrowserDetail></ns0:POS><ns0:MerchantDetail MerchantID="2025145" MerchantName="Daniel Hotel" MerchantCategoryCode="002"/><ns0:PaymentDetail><ns0:FOP Type="CC"/><ns0:PaymentCard CardCode="VI" CardNumber="4111111111111111" CardSecurityCode="332" ExpireDate="1217"><ns0:CardHolderName Name="Test X. Test" FirstName="Jane" LastName="Curtain"/><ns0:Address><ns0:AddressLine1>Address Line 1</ns0:AddressLine1><ns0:CityName>Newton</ns0:CityName><ns0:PostalCode>01111</ns0:PostalCode><ns0:County>USA</ns0:County><ns0:StateProv StateCode="MA"/></ns0:Address><ns0:EmailAddress>test@test.com</ns0:EmailAddress><ns0:PhoneNumber Number="123-123-1234"/></ns0:PaymentCard><ns0:AmountDetail Amount="420.0" CurrencyCode="EUR"/><ns0:RoutingDetail/></ns0:PaymentDetail></ns0:PaymentRQ></ns1:Body></ns1:Envelope>